Revit 2027 API
BuiltInFailures.OpeningFailures.OpeningNegativeHeight Property
 The top of the Opening is lower than the bottom of the Opening or coincident with it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpeningNegativeHeight { get; }
Public Shared ReadOnly Property OpeningNegativeHeight As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpeningNegativeHeight {
	FailureDefinitionId^ get ();
}
static member OpeningNegativeHeight : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace